app/views/books/_favorite.html.erb

    <%= link_to book_favorites_path(book), method: :delete do %>
        ♥<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

    <%= link_to book_favorites_path(book), method: :post do %>
        ♥<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]