app/views/books/show.html.erb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
          <td><%= render 'favorite', book: @book %></td>
          <td>コメント数: <%= @book.book_comments.count %></td>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
      <div class="comments">
        <% @book.book_comments.each do |book_comment| %>