app/controllers/book_comments_controller.rb

    def create
      @book = Book.find(params[:book_id])
      comment = BookComment.new(book_comment_params)
      comment.user_id = current_user.id
      comment.book_id = @book.id
      comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "test1"], ["user_id", 1], ["book_id", 1], ["created_at", "2021-11-01 08:01:00.392310"], ["updated_at", "2021-11-01 08:01:00.392310"]]